<a href="https://colab.research.google.com/github/a-dhingra/JupyterNotebooks/blob/master/Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
s = 'string'

In [ ]:
L = [x for x in s]

In [ ]:
L

['s', 't', 'r', 'i', 'n', 'g']

In [ ]:
K = ('').join(L)

In [ ]:
K

'string'

In [ ]:
for i in K:
  print(i)

s
t
r
i
n
g

In [ ]:
import re

def fun(s):
    email = re.compile(r"[\w*\d*\-*\_*]*\@[\w\d]*\.[\w\d\W]{,3}")
    mo = email.findall(s)
    if len(mo) > 0:
        return True
    else:
        return False

# 5
# dheeraj-234@gmail.com
# itsallcrap
# harsh_1234@rediff.in
# kunal_shin@iop.az
# matt23@@india.in
        
def filter_mail(emails):
    return list(filter(fun, emails))

if __name__ == '__main__':
    n = int(input())
    emails = []
    for _ in range(n):
        emails.append(input())

filtered_emails = filter_mail(emails)
filtered_emails.sort()
print(filtered_emails)

In [1]:
import pandas as pd 
import numpy as np

In [4]:
df = pd.DataFrame(np.ndarray([5,4], dtype= int, offset= 1))
df.head()

          0  1  2  3
0  70779968  0  0  0
1         0  0  0  0
2         0  0  0  0
3         0  0  0  0
4         0  0  0  0

In [7]:
df = df.applymap(lambda x: (x+1)*np.random.randint(100))
df

     0    1    2    3
0   73    4  430    4
1  365  145  294  345
2  168  195   42   17
3  268  120  168   84
4   56  480   96  258

In [8]:
df.columns = ['A','B','C','D']
df

     A    B    C    D
0   73    4  430    4
1  365  145  294  345
2  168  195   42   17
3  268  120  168   84
4   56  480   96  258

In [11]:
kids = ['Ram','Sham','Mohan','Bagan','Awara']
df = df.set_index(pd.Series(kids))
df

         A    B    C    D
Ram     73    4  430    4
Sham   365  145  294  345
Mohan  168  195   42   17
Bagan  268  120  168   84
Awara   56  480   96  258

In [12]:
df1 = df.iloc[:3,-2:]
df1

         C    D
Ram    430    4
Sham   294  345
Mohan   42   17

In [13]:
df1['E'] = df1['D']*50
df1

         C    D      E
Ram    430    4    200
Sham   294  345  17250
Mohan   42   17    850

In [27]:
df_merge = df.merge(df1,how='outer'
                    , left_index=True, right_index=True
                    # , on=df.index()
                    )
df_merge

         A    B  C_x  D_x    C_y    D_y        E
Awara   56  480   96  258    NaN    NaN      NaN
Bagan  268  120  168   84    NaN    NaN      NaN
Mohan  168  195   42   17   42.0   17.0    850.0
Ram     73    4  430    4  430.0    4.0    200.0
Sham   365  145  294  345  294.0  345.0  17250.0

In [29]:
df_concat = pd.concat([df,df1], axis=1)
df_concat

         A    B    C    D      C      D        E
Ram     73    4  430    4  430.0    4.0    200.0
Sham   365  145  294  345  294.0  345.0  17250.0
Mohan  168  195   42   17   42.0   17.0    850.0
Bagan  268  120  168   84    NaN    NaN      NaN
Awara   56  480   96  258    NaN    NaN      NaN

In [31]:
df_concat1 = pd.concat([df,df1], axis='rows')
df_concat1

           A      B    C    D        E
Ram     73.0    4.0  430    4      NaN
Sham   365.0  145.0  294  345      NaN
Mohan  168.0  195.0   42   17      NaN
Bagan  268.0  120.0  168   84      NaN
Awara   56.0  480.0   96  258      NaN
Ram      NaN    NaN  430    4    200.0
Sham     NaN    NaN  294  345  17250.0
Mohan    NaN    NaN   42   17    850.0

In [32]:
df_concat1.sort_index(inplace=True)
df_concat1

           A      B    C    D        E
Awara   56.0  480.0   96  258      NaN
Bagan  268.0  120.0  168   84      NaN
Mohan  168.0  195.0   42   17      NaN
Mohan    NaN    NaN   42   17    850.0
Ram     73.0    4.0  430    4      NaN
Ram      NaN    NaN  430    4    200.0
Sham   365.0  145.0  294  345      NaN
Sham     NaN    NaN  294  345  17250.0

In [33]:
df_concat1.to_csv('pandas_test.csv', index=False)